## Sort

In [1]:
import pandas as pd

In [2]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
#lista de string
list('321')

['3', '2', '1']

In [4]:
#criando dataframe
df = pd.DataFrame(data, list('321'), list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [5]:
#sort index
df.sort_index(inplace=True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [6]:
#sort index 2
df.sort_index(inplace=True, axis= 1)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [7]:
#sort values
df.sort_values(by ='x', inplace=True)
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [8]:
#sort values | colunas como referencia
df.sort_values(by ='3', axis =1, inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [9]:
#sort values 3 - by como lista
df.sort_values(by = ['x', 'y'], inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9